{
    "articles": [
        {
            "id": 1,
            "component": "ArticlePortfolio",
            "locales": {
                "en": {
                    "title": null,
                    "category_all": "All",
                    "category_productivity": "University",
                    "category_social": "Freelance"
                },

                "es": {
                    "title": null,
                    "category_all": "Todos",
                    "category_productivity": "Productividad",
                    "category_social": "Social",
                    "category_utilities": "Utilidades"
                }
            },
            "settings": {
                "order_items_by": "id",
                "order_items_sort": "asc"
            },
            "items": [
                {
                "id": 1,
                "img": null,
                "fallbackFaIcon": "fa-solid fa-user-tag",
                "fallbackFaIconColor": null,
                "category": "productivity",
                "locales": {
                    "en": {
                    "title": "Suit Store",
                    "description": "<b>Suit Store</b> was my very first university project — a simple HTML & CSS webpage built with basic technologies. Despite its simplicity, I aimed to maintain a unique and modern aesthetic with an elegant, stylish design. This project marked the beginning of my journey into web development.",
                    "tags": ["university", "html", "css", "design", "elegant"]
                    },
                    "es": {
                    "description": "<b>Suit Store</b> fue mi primer proyecto universitario: una página web sencilla construida con HTML y CSS básicos. A pesar de su simplicidad, me esforcé por mantener una estética única, moderna y elegante. Este proyecto marcó el inicio de mi camino en el desarrollo web.",
                    "tags": ["universidad", "html", "css", "diseño", "elegante"]
                    }
                },
                "links": [
                        {"faIcon": "fa-solid fa-file-lines", "href": "https://cbhud.github.io/suit-store/", "stringKey": "view_site"}
                    ]
                },
                {
  "id": 2,
  "img": null,
  "fallbackFaIcon": "fa-solid fa-users-gear",
  "fallbackFaIconColor": "#4a7ba1",
  "category": "social",
  "locales": {
    "en": {
      "title": "Unija-Challenge",
      "description": "<b>Unija-Challenge</b> is a mobile application developed for the <a href='https://challenge.unija.com/cg/' target='_blank'>Unija Challenge</a> event — a competition focused on creating IT solutions for the accounting company UNIJA.<br><br>The app allows users to take a picture of an accounting document and automatically convert it into a PDF using AI-enhanced image sharpening and OCR (Optical Character Recognition).<br><br>I participated as part of a development team using Java and Android Studio to build the app during the competition.",
      "tags": ["ocr", "android", "ai", "pdf", "image processing", "java", "accounting"]
    },
    "es": {
      "description": "<b>Unija-Challenge</b> je mobilna aplikacija razvijena tokom <a href='https://challenge.unija.com/cg/' target='_blank'>Unija Challenge</a> takmičenja — fokusiranog na izradu IT rešenja za potrebe računovodstvene kompanije UNIJA.<br><br>Aplikacija omogućava korisnicima da fotografišu računovodstveni dokument i automatski ga pretvore u PDF pomoću AI poboljšanja slike i OCR (optičko prepoznavanje teksta).<br><br>Učestvovao sam kao deo razvojnog tima koristeći Java programski jezik i Android Studio.",
      "tags": ["ocr", "android", "ai", "pdf", "obrada slike", "java", "računovodstvo"]
    }
  },
  "links": [
    {
      "faIcon": "fa-solid fa-link",
      "href": "https://challenge.unija.com/cg/",
      "stringKey": "project_website"
    },
        {
      "faIcon": "fa-solid fa-image",
      "href": "https://ibb.co/qF0LrVK",
      "stringKey": "project_certificate"
    }
  ]
},
{
  "id": 3,
  "img": null,
  "fallbackFaIcon": "fa-solid fa-train-subway",
  "fallbackFaIconColor": "#3e8e41",
  "category": "productivity",
  "locales": {
    "en": {
      "title": "UBP - Railway Management System",
      "description": "<b>UBP - Railway Management System</b> is a university final project developed for the Introduction to Databases course at the University \"Mediteran\" in Podgorica.<br><br>The system models a real-world railway business, supporting scheduling, ticketing, employee and medical exam tracking, and pricing.<br><br>It includes a fully normalized MySQL database, ER and relational diagrams designed in MySQL Workbench, and a Java console application using JDBC for full CRUD operations. I designed the database, implemented the schema, and developed the application logic as part of the final evaluation.<br><br>The app also supports statistics like ticket sales and monthly revenue reports.",
      "tags": ["university", "database", "mysql", "jdbc", "java", "crud", "railway"]
    },
    "es": {
      "description": "<b>UBP - Railway Management System</b> es un proyecto final universitario desarrollado para el curso de Introducción a Bases de Datos en la Universidad \"Mediteran\" en Podgorica.<br><br>El sistema simula una empresa ferroviaria real, con funcionalidades de horarios, ventas de boletos, gestión de empleados, exámenes médicos y precios.<br><br>Incluye una base de datos MySQL normalizada, diagramas ER y relacionales diseñados en MySQL Workbench, y una aplicación de consola en Java con JDBC para operaciones CRUD. Diseñé la base de datos, implementé el esquema y desarrollé la lógica de la aplicación como parte de la evaluación final.<br><br>La app también proporciona estadísticas como ventas de boletos y seguimiento de ingresos mensuales.",
      "tags": ["universidad", "base de datos", "mysql", "jdbc", "java", "crud", "ferrocarril"]
    }
  },
  "links": [
        {
      "faIcon": "fa-solid fa-link",
      "href": "https://github.com/cbhud/UBP",
      "stringKey": "project_website"
    }
  ]
},
{
  "id": 4,
  "img": null,
  "fallbackFaIcon": "fa-solid fa-film",
  "fallbackFaIconColor": "#9c27b0",
  "category": "productivity",
  "locales": {
    "en": {
      "title": "Letterboxd (Graph-Based Movie Network)",
      "description": "<b>Letterboxd</b> is a graph-based social network for movie recommendations, developed as a final project for the Data Structures & Algorithms course at University \"Mediteran\".<br><br>Each user is represented as a graph node, and friendships are weighted edges based on shared liked movies. The application allows friend recommendations, friendship analysis, and manipulation of user data, all built using custom data structures like `HashSet`, `LinkedList`, and `ArrayList`.<br><br>The system was implemented in Java using an object-oriented approach, demonstrating efficient graph traversal and real-world application of core algorithms.",
      "tags": ["university", "java", "graphs", "algorithms", "data structures", "social network", "movies"]
    },
    "es": {
      "description": "<b>Letterboxd</b> es una red social basada en grafos para recomendaciones de películas, desarrollada como proyecto final del curso de Estructuras de Datos y Algoritmos en la Universidad \"Mediteran\".<br><br>Cada usuario se representa como un nodo en el grafo, y las amistades son aristas ponderadas según las películas en común. La aplicación permite sugerencias de amistad, análisis de relaciones y manipulación de datos del usuario, todo construido con estructuras de datos como `HashSet`, `LinkedList` y `ArrayList`.<br><br>El sistema fue implementado en Java utilizando un enfoque orientado a objetos, mostrando un uso eficiente de grafos y algoritmos prácticos.",
      "tags": ["universidad", "java", "grafos", "algoritmos", "estructuras de datos", "red social", "películas"]
    }
  },
  "links": [        {
      "faIcon": "fa-solid fa-link",
      "href": "https://github.com/cbhud/letterboxd",
      "stringKey": "project_website"
    }]
},
{
  "id": 5,
  "img": null,
  "fallbackFaIcon": "fa-solid fa-chess-rook",
  "fallbackFaIconColor": "#c0392b",
  "category": "social",
  "locales": {
    "en": {
      "title": "CastleSiege",
      "description": "<b>CastleSiege</b> is a Minecraft plugin inspired by the classic Mineplex game mode of the same name. Built using Java and Spigot API, the project brings fast-paced PvP siege gameplay back to modern Minecraft servers.<br><br>The plugin features custom classes, wave-based spawning, team balancing, castle defense mechanics, and configurable settings. It was designed to be lightweight and easy to integrate, and it's open-source and actively maintained on GitHub.",
      "tags": ["minecraft", "spigot", "java", "game", "plugin", "castle", "pvp"]
    },
    "es": {
      "description": "<b>CastleSiege</b> es un plugin de Minecraft inspirado en el clásico modo de juego de Mineplex. Desarrollado en Java con la API de Spigot, revive la jugabilidad de asedio PvP en servidores modernos.<br><br>El plugin incluye clases personalizadas, oleadas de enemigos, balanceo de equipos, mecánicas de defensa de castillo y opciones totalmente configurables. Es ligero, fácil de integrar y de código abierto.",
      "tags": ["minecraft", "spigot", "java", "juego", "plugin", "castillo", "pvp"]
    }
  },
  "links": [
    {
      "faIcon": "fa-brands fa-github",
      "href": "https://github.com/cbhud/CastleSiege",
      "stringKey": "view_on_github"
    }
  ]
},
{
  "id": 6,
  "img": null,
  "fallbackFaIcon": "fa-solid fa-leaf",
  "fallbackFaIconColor": "#2ecc71",
  "category": "social",
  "locales": {
    "en": {
      "title": "Organic Health Store",
      "description": "<b>Organic Health Store</b> is a full-stack university final project — a complete PHP-based e-commerce platform for organic products. The system includes a secure user authentication system, admin dashboard, dynamic product management, and a full shopping cart and checkout flow.<br><br>Built with security and performance in mind, it supports AJAX-powered cart interactions, real-time product filtering, secure session handling, and downloadable CSV reporting for admins. The relational database includes well-structured tables for users, orders, products, and categories.<br><br>The project demonstrates best practices in PHP development and showcases a scalable and secure store suitable for real-world deployment.",
      "tags": ["university", "php", "e-commerce", "mysql", "ajax", "admin panel", "security"]
    },
    "es": {
      "description": "<b>Organic Health Store</b> es un proyecto final universitario de pila completa — una plataforma de comercio electrónico desarrollada con PHP para productos orgánicos. El sistema incluye autenticación de usuarios segura, panel de administración, gestión dinámica de productos y un carrito de compras completo con flujo de pago.<br><br>Con enfoque en seguridad y rendimiento, admite interacciones con el carrito vía AJAX, filtrado en tiempo real, manejo seguro de sesiones y generación de informes CSV para los administradores. La base de datos relacional incluye tablas estructuradas para usuarios, pedidos, productos y categorías.<br><br>El proyecto demuestra buenas prácticas en desarrollo PHP y ofrece una tienda segura y escalable para implementación real.",
      "tags": ["universidad", "php", "comercio electrónico", "mysql", "ajax", "panel admin", "seguridad"]
    }
  },
  "links": [
    {
      "faIcon": "fa-solid fa-link",
      "href": "http://organichealth.zya.me/index.php",
      "stringKey": "live_demo"
    }
  ]
},
{
  "id": 7,
  "img": null,
  "fallbackFaIcon": "fa-solid fa-clapperboard",
  "fallbackFaIconColor": "#34495e",
  "category": "productivity",
  "locales": {
    "en": {
      "title": "FilmTrack (Track watched movies)",
      "description": "<b>filmTrack</b> is a backend-focused university project built using the Quarkus framework. The app allows users to track watched movies, authenticate, write reviews, and store personal film data. It integrates with the <a href='https://www.omdbapi.com/' target='_blank'>OMDb API</a> for fetching movie metadata, and exposes RESTful APIs for all core functionality.<br><br>The backend includes a relational database for managing users, movies, and reviews. As part of expanding the project, I began developing the frontend using Vue.js — my first experience with frontend development.<br><br>This project demonstrates full-stack development with modern Java and JavaScript technologies, while learning API integration, security, and UI design fundamentals.",
      "tags": ["university", "quarkus", "java", "vue", "rest api", "movies", "backend", "frontend"]
    },
    "es": {
      "description": "<b>filmTrack</b> es un proyecto universitario centrado en el backend y desarrollado con el framework Quarkus. La aplicación permite a los usuarios seguir películas vistas, autenticarse, escribir reseñas y guardar datos de películas. Se integra con la <a href='https://www.omdbapi.com/' target='_blank'>OMDb API</a> para obtener información de películas y ofrece APIs REST para toda la funcionalidad.<br><br>El backend utiliza una base de datos relacional para gestionar usuarios, películas y reseñas. Como parte de la expansión del proyecto, comencé a desarrollar el frontend con Vue.js — mi primer contacto con desarrollo de interfaces.<br><br>Este proyecto demuestra habilidades full-stack con tecnologías modernas de Java y JavaScript, integración de APIs y fundamentos de seguridad y diseño UI.",
      "tags": ["universidad", "quarkus", "java", "vue", "api rest", "películas", "backend", "frontend"]
    }
  },
  "links": [
    {
      "faIcon": "fa-brands fa-github",
      "href": "https://github.com/cbhud/filmTrack",
      "stringKey": "view_backend_on_github"
    },
        {
      "faIcon": "fa-brands fa-github",
      "href": "https://github.com/cbhud/filmTrack-frontend",
      "stringKey": "view_backend_on_github"
    }
  ]
}






            ]
        }
    ]
}